In [39]:
duplicates  = df[df.duplicated(subset = ['A', 'B', 'C'])]
print(duplicates)

NameError: name 'df' is not defined

In [41]:
data = {
    'Name' : ["Hrushi", 'Rahul', 'Prerna', 'Shantabai'],
    'id': [1, 2,3,4],
    'Age': [27, 44,77, 23]
}

In [43]:
data

{'Name': ['Hrushi', 'Rahul', 'Prerna', 'Shantabai'],
 'id': [1, 2, 3, 4],
 'Age': [27, 44, 77, 23]}

In [45]:
import pandas as pd

In [47]:
df = pd.DataFrame(data)

In [49]:
df

        Name  id  Age
0     Hrushi   1   27
1      Rahul   2   44
2     Prerna   3   77
3  Shantabai   4   23

In [51]:
df2 =pd.DataFrame(
    {  
    'Name' : ["Hrushi", 'Rahul', 'Prerna', 'Shantabai'],
    'id': [1, 2,3,4],
    'Age': [27, 44,77, 23]
        
    }
)

In [53]:
df2

        Name  id  Age
0     Hrushi   1   27
1      Rahul   2   44
2     Prerna   3   77
3  Shantabai   4   23

In [56]:
loc[] b

SyntaxError: invalid syntax (3782671021.py, line 1)

In [58]:
A = [2,2,5,7,13] 
   = 0,1,2
   = 0,3
   =1,3

IndentationError: unexpected indent (1104216357.py, line 2)

In [60]:
def find_index(st, value_ad, target):
    
    for i in enumerate(st):
        if num + value_ad == target:
            return i
    return -1
A = [2,2,5,7,13] 
value_ad = 2
taget = 9

index = find_index(A,value_ad, target))
print(index)

SyntaxError: unmatched ')' (3621100951.py, line 11)

In [63]:
import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

In [65]:
import pandas as pd

In [67]:
if __name__ == "__main__":
    print("Hello, World!")

Hello, World!

In [69]:
if __name__ == "__main__":
    print("Hello")

Hello

In [71]:
# Suppose this is foo.py.

print("before import")
import math

print("before function_a")
def function_a():
    print("Function A")

print("before function_b")
def function_b():
    print("Function B {}".format(math.sqrt(100)))

print("before __name__ guard")
if __name__ == '__main__':
    function_a()
    function_b()
#
print("after __name__ guard")

before import
before function_a
before function_b
before __name__ guard
Function A
Function B 10.0
after __name__ guard

In [73]:
print("Nehe : Hi Hrushitosh")

def call():
    print("Neha : How are you")

print("Neha : Where are you")
def HrushiA():
    print("Hrushi : I am fine")

print("Hrushi : i am in hyderabad")

def HrushiB():
    print("Hrushi: how are you neha")

if __name__ == "__main__":
    HrushiA()
    HrushiB()

Nehe : Hi Hrushitosh
Neha : Where are you
Hrushi : i am in hyderabad
Hrushi : I am fine
Hrushi: how are you neha

In [74]:
import pandas as pd

In [75]:
house = pd.read_csv('https://github.com/YBIFoundation/Dataset/raw/main/Boston.csv')
house

,CRIM,ZN,INDUS,CHAS,NX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,11.9

In [76]:
house.isnull().sum()

CRIM       0
ZN         0
INDUS      0
CHAS       0
NX         0
RM         0
AGE        0
DIS        0
RAD        0
TAX        0
PTRATIO    0
B          0
LSTAT      0
MEDV       0
dtype: int64

In [80]:
a = [1,22,55,100,2,33,44,66]

In [81]:
a.sort()

In [82]:
a

[1, 2, 22, 33, 44, 55, 66, 100]

In [83]:
a.append(77)

In [84]:
a

[1, 2, 22, 33, 44, 55, 66, 100, 77]

In [85]:
a.extend([33,44])

In [88]:
a

[1, 2, 22, 33, 44, 55, 66, 100, 77, 33, 44]

In [92]:
a.remove(2)

In [96]:
a

[1, 22, 33, 44, 55, 66, 100, 77, 33, 44]

In [98]:
a.pop(2)

33

In [99]:
a

[1, 22, 44, 55, 66, 100, 77, 33, 44]

In [101]:
a = {1,22,55,100,2,33,44,66}

In [103]:
a

{1, 2, 22, 33, 44, 55, 66, 100}

In [106]:
a.add(7)

In [109]:
a

{1, 2, 7, 22, 33, 44, 55, 66, 100}

In [111]:
a.update ([77,'Nikita'])

In [114]:
a

{1, 100, 2, 22, 33, 44, 55, 66, 7, 77, 'Nikita'}

In [115]:
a.remove(100)

In [118]:
a

{1, 2, 22, 33, 44, 55, 66, 7, 77, 'Nikita'}

In [120]:
a.discard(22)

In [122]:
a

{1, 2, 33, 44, 55, 66, 7, 77, 'Nikita'}

In [124]:
a.pop()

1

In [126]:
a

{2, 33, 44, 55, 66, 7, 77, 'Nikita'}

In [128]:
a = {
    'Name' : 'Nikita',
    'Age' : 28,
    'Location': 'Goa',  
    'Job': 'Bouncer'
}

In [130]:
a

{'Name': 'Nikita', 'Age': 28, 'Location': 'Goa', 'Job': 'Bouncer'}

In [132]:
a.keys()

dict_keys(['Name', 'Age', 'Location', 'Job'])

In [133]:
a['Name']

'Nikita'

In [136]:
a['Job']

'Bouncer'

In [137]:
a['Friend'] = 'Hrushi'

In [140]:
a.values()

dict_values(['Nikita', 28, 'Goa', 'Bouncer', 'Hrushi'])

In [142]:
a.items()

dict_items([('Name', 'Nikita'), ('Age', 28), ('Location', 'Goa'), ('Job', 'Bouncer'), ('Friend', 'Hrushi')])

In [144]:
a

{'Name': 'Nikita',
 'Age': 28,
 'Location': 'Goa',
 'Job': 'Bouncer',
 'Friend': 'Hrushi'}

In [146]:
a['2nd_friend'] = 'Shalu'

In [148]:
a

{'Name': 'Nikita',
 'Age': 28,
 'Location': 'Goa',
 'Job': 'Bouncer',
 'Friend': 'Hrushi',
 '2nd_friend': 'Shalu'}

In [150]:
a.update({'city':23, 'hotel': 'Panajabi kithcen'})

In [152]:
a

{'Name': 'Nikita',
 'Age': 28,
 'Location': 'Goa',
 'Job': 'Bouncer',
 'Friend': 'Hrushi',
 '2nd_friend': 'Shalu',
 'city': 23,
 'hotel': 'Panajabi kithcen'}

In [154]:
a

{'Name': 'Nikita',
 'Age': 28,
 'Location': 'Goa',
 'Job': 'Bouncer',
 'Friend': 'Hrushi',
 '2nd_friend': 'Shalu',
 'city': 23,
 'hotel': 'Panajabi kithcen'}

In [156]:
for i in range(1,100,6):   
    print(i)

1
7
13
19
25
31
37
43
49
55
61
67
73
79
85
91
97

In [158]:
x = 10
y = 20
z = x+y

In [160]:
no_of_apples = 10
no_of_oranges

NameError: name 'no_of_oranges' is not defined

In [162]:
import pandas as pd

# Creating two DataFrames
df1 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': ['a', 'b', 'c']
}, index=['x', 'y', 'z'])
print(df1)

   A  B
x  1  a
y  2  b
z  3  c

In [164]:
df2 = pd.DataFrame({
    'C': [4, 5, 6],
    'D': ['d', 'e', 'f']
}, index=['x', 'y', 'z'])
print(df2)

   C  D
x  4  d
y  5  e
z  6  f

In [166]:
# Join the DataFrames using the index
result = df1.join(df2)
print(result)

   A  B  C  D
x  1  a  4  d
y  2  b  5  e
z  3  c  6  f

In [168]:
# Creating two DataFrames
df1 = pd.DataFrame({'A': [1, 2], 'B': ['a', 'b']})
df2 = pd.DataFrame({'A': [3, 4], 'B': ['c', 'd']})

In [170]:
print(df1)

   A  B
0  1  a
1  2  b

In [172]:
print(df2)

   A  B
0  3  c
1  4  d

In [174]:
# Concatenate by rows (axis=0)
result = pd.concat([df1, df2], axis=0)
print(result)

   A  B
0  1  a
1  2  b
0  3  c
1  4  d

In [176]:
result2 = pd.concat([df2, df1], axis=1)
print(result2)

   A  B  A  B
0  3  c  1  a
1  4  d  2  b

In [177]:
d1 = pd.DataFrame({
    'NO':[11,22,33,88,44,55,88,99,11,22,33,88,44,55,88,99],
    'ID': [1,2,3,4,8,5,8,9,1,2,3,4,8,5,8,9],
    'NAME': [111,888,222,333,444,555,888,999,111,888,222,333,444,555,888,999],
    'SCORE': [1111,8888,2222,3333,4444,5555,8888,9999,1111,8888,2222,3333,4444,5555,8888,9999],
})

d2= pd.DataFrame ({
    'ID1':[1,2,6,3,4,5,6,7],
    'NO1': [10,20,50,30,40,50,50,60],
    'NAME1': [100,200,300,500,400,500,500,600],
    'SCORE1': [1000,2000,3000,5000,4000,5000,5000,6000],
})

In [181]:
d1

    NO  ID  NAME  SCORE
0   11   1   111   1111
1   22   2   888   8888
2   33   3   222   2222
3   88   4   333   3333
4   44   8   444   4444
5   55   5   555   5555
6   88   8   888   8888
7   99   9   999   9999
8   11   1   111   1111
9   22   2   888   8888
10  33   3   222   2222
11  88   4   333   3333
12  44   8   444   4444
13  55   5   555   5555
14  88   8   888   8888
15  99   9   999   9999

In [182]:
d2

   ID1  NO1  NAME1  SCORE1
0    1   10    100    1000
1    2   20    200    2000
2    6   50    300    3000
3    3   30    500    5000
4    4   40    400    4000
5    5   50    500    5000
6    6   50    500    5000
7    7   60    600    6000

In [185]:
d1.join(d2)

    NO  ID  NAME  SCORE  ID1   NO1  NAME1  SCORE1
0   11   1   111   1111  1.0  10.0  100.0  1000.0
1   22   2   888   8888  2.0  20.0  200.0  2000.0
2   33   3   222   2222  6.0  50.0  300.0  3000.0
3   88   4   333   3333  3.0  30.0  500.0  5000.0
4   44   8   444   4444  4.0  40.0  400.0  4000.0
5   55   5   555   5555  5.0  50.0  500.0  5000.0
6   88   8   888   8888  6.0  50.0  500.0  5000.0
7   99   9   999   9999  7.0  60.0  600.0  6000.0
8   11   1   111   1111  NaN   NaN    NaN     NaN
9   22   2   888   8888  NaN   NaN    NaN     NaN
10  33   3   222   2222  NaN   NaN    NaN     NaN
11  88   4   333   3333  NaN   NaN    NaN     NaN
12  44   8   444   4444  NaN   NaN    NaN     NaN
13  55   5   555   5555  NaN   NaN    NaN     NaN
14  88   8   888   8888  NaN   NaN    NaN     NaN
15  99   9   999   9999  NaN   NaN    NaN     NaN

In [187]:
d1.join(d2, how='inner')

   NO  ID  NAME  SCORE  ID1  NO1  NAME1  SCORE1
0  11   1   111   1111    1   10    100    1000
1  22   2   888   8888    2   20    200    2000
2  33   3   222   2222    6   50    300    3000
3  88   4   333   3333    3   30    500    5000
4  44   8   444   4444    4   40    400    4000
5  55   5   555   5555    5   50    500    5000
6  88   8   888   8888    6   50    500    5000
7  99   9   999   9999    7   60    600    6000

In [189]:
d1.join(d2, how='outer')

    NO  ID  NAME  SCORE  ID1   NO1  NAME1  SCORE1
0   11   1   111   1111  1.0  10.0  100.0  1000.0
1   22   2   888   8888  2.0  20.0  200.0  2000.0
2   33   3   222   2222  6.0  50.0  300.0  3000.0
3   88   4   333   3333  3.0  30.0  500.0  5000.0
4   44   8   444   4444  4.0  40.0  400.0  4000.0
5   55   5   555   5555  5.0  50.0  500.0  5000.0
6   88   8   888   8888  6.0  50.0  500.0  5000.0
7   99   9   999   9999  7.0  60.0  600.0  6000.0
8   11   1   111   1111  NaN   NaN    NaN     NaN
9   22   2   888   8888  NaN   NaN    NaN     NaN
10  33   3   222   2222  NaN   NaN    NaN     NaN
11  88   4   333   3333  NaN   NaN    NaN     NaN
12  44   8   444   4444  NaN   NaN    NaN     NaN
13  55   5   555   5555  NaN   NaN    NaN     NaN
14  88   8   888   8888  NaN   NaN    NaN     NaN
15  99   9   999   9999  NaN   NaN    NaN     NaN

In [191]:
d1.join(d2, how='left')

    NO  ID  NAME  SCORE  ID1   NO1  NAME1  SCORE1
0   11   1   111   1111  1.0  10.0  100.0  1000.0
1   22   2   888   8888  2.0  20.0  200.0  2000.0
2   33   3   222   2222  6.0  50.0  300.0  3000.0
3   88   4   333   3333  3.0  30.0  500.0  5000.0
4   44   8   444   4444  4.0  40.0  400.0  4000.0
5   55   5   555   5555  5.0  50.0  500.0  5000.0
6   88   8   888   8888  6.0  50.0  500.0  5000.0
7   99   9   999   9999  7.0  60.0  600.0  6000.0
8   11   1   111   1111  NaN   NaN    NaN     NaN
9   22   2   888   8888  NaN   NaN    NaN     NaN
10  33   3   222   2222  NaN   NaN    NaN     NaN
11  88   4   333   3333  NaN   NaN    NaN     NaN
12  44   8   444   4444  NaN   NaN    NaN     NaN
13  55   5   555   5555  NaN   NaN    NaN     NaN
14  88   8   888   8888  NaN   NaN    NaN     NaN
15  99   9   999   9999  NaN   NaN    NaN     NaN

In [193]:
d1.join(d2, how='right')

   NO  ID  NAME  SCORE  ID1  NO1  NAME1  SCORE1
0  11   1   111   1111    1   10    100    1000
1  22   2   888   8888    2   20    200    2000
2  33   3   222   2222    6   50    300    3000
3  88   4   333   3333    3   30    500    5000
4  44   8   444   4444    4   40    400    4000
5  55   5   555   5555    5   50    500    5000
6  88   8   888   8888    6   50    500    5000
7  99   9   999   9999    7   60    600    6000

In [195]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02'],
    'Store': ['Store A', 'Store B', 'Store A', 'Store B'],
    'Sales': [250, 300, 200, 350]
})

print(df)

         Date    Store  Sales
0  2024-01-01  Store A    250
1  2024-01-01  Store B    300
2  2024-01-02  Store A    200
3  2024-01-02  Store B    350

In [197]:
# Pivot the data
pivoted_df = df.pivot(index='Date', columns='Store', values='Sales')
print(pivoted_df)

Store       Store A  Store B
Date
2024-01-01      250      300
2024-01-02      200      350

In [199]:
for i in range(1,10):
    if i == 5:
        continue
    print(i)

1
2
3
4
6
7
8
9

In [201]:
a = [1,3,4,2,3,4,324,43,3]

In [203]:
a[2:6:1]

[4, 2, 3, 4]

In [205]:
d1

    NO  ID  NAME  SCORE
0   11   1   111   1111
1   22   2   888   8888
2   33   3   222   2222
3   88   4   333   3333
4   44   8   444   4444
5   55   5   555   5555
6   88   8   888   8888
7   99   9   999   9999
8   11   1   111   1111
9   22   2   888   8888
10  33   3   222   2222
11  88   4   333   3333
12  44   8   444   4444
13  55   5   555   5555
14  88   8   888   8888
15  99   9   999   9999

In [220]:
d1.min()

NO         11
ID          1
NAME      111
SCORE    1111
dtype: int64

In [222]:
class Student():
    def show(self,name,age,salary):
        self.name = name
        self.age = age
        self.salary = salary
        print(self.name)
        print(self.age)
        print(self.salary)
a = Student()
a.show('Rushi',28,34332)

Rushi
28
34332

In [234]:
class Employee():
    def show(self,name,age,year):
        self.name = name
        self.age = age
        self.year = year
        print(self.name)
        print(self.age)
        print(self.year)
a = Employee()
a.show('Navinya', 34, 1997)

Navinya
34
1997

In [246]:
class Employee():
    def __init__(self,name,age,year):
        self.name = name
        self.age = age
        self.year = year
    def show(self):
        print(self.name)
        print(self.age)
        print(self.year)
a = Employee('Hraha', 33,1997)
a.show()

Hraha
33
1997

In [276]:
class Mobile:
    def __init__(self,m):
        self.model = m
        
    def show_model(self,p):
        self.prize = p
        print("Model:",self.model, "prize:", self.prize)

a = Mobile("sefaskhf")
a.show_model(67898)

Model: sefaskhf prize: 67898

In [286]:
class Moble:
    def __init__(self,price,qty,sale):
        self.price = price
        self.qty = qty
        self.sale = sale 
    def cal_prize(self):
        self.p = self.price * self.qty
        print(self.p)
        
a = Mobile(12,44,2323)
a.cal_prize()

528

In [284]:
class Mobile:  # Corrected the class name here
    def __init__(self, price, qty, sale):
        self.price = price
        self.qty = qty
        self.sale = sale 
    
    def cal_prize(self):
        self.p = self.price * self.qty
        print(self.p)

a = Mobile(12, 44, 2323)  # Corrected the class name here as well
a.cal_prize()

528